In [2]:
import pandas as pd
data={'Name':['Priyansu','Puja','Akhanshya'],'Age':[23,40,33],}
df=pd.DataFrame(data)
print(df)

        Name  Age
0   Priyansu   23
1       Puja   40
2  Akhanshya   33

In [10]:
import pandas as pd
data={'Name':['Priyansu','Puja','Akhanshya','Utkalika','Ankita'],
      'Age':[23,40,29,27,38],
      'City':['Rourkela','Bhubaneswar','Cuttack','Balasore','Jamshedpur']}
df=pd.DataFrame(data)
print(df)

age_df=df[df['Age']>30]
print(age_df)

asc_df = df.sort_values(by='Age', ascending=True)
print(asc_df)

        Name  Age         City
0   Priyansu   23     Rourkela
1       Puja   40  Bhubaneswar
2  Akhanshya   29      Cuttack
3   Utkalika   27     Balasore
4     Ankita   38   Jamshedpur
     Name  Age         City
1    Puja   40  Bhubaneswar
4  Ankita   38   Jamshedpur
        Name  Age         City
0   Priyansu   23     Rourkela
3   Utkalika   27     Balasore
2  Akhanshya   29      Cuttack
4     Ankita   38   Jamshedpur
1       Puja   40  Bhubaneswar

In [12]:
import pandas as pd

df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Bubu', 'Babu', 'Mitthi', 'Linu']
})

df2 = pd.DataFrame({
    'ID': [2, 4, 3, 5],
    'City': ['Delhi', 'Mumbai', 'Kolkata', 'Chennai']
})

merged_df = pd.merge(df1, df2, on='ID')

print("Merged DataFrame:")
print(merged_df)

Merged DataFrame:
   ID    Name     City
0   2    Babu    Delhi
1   3  Mitthi  Kolkata
2   4    Linu   Mumbai

In [26]:
import pandas as pd
data={'Name':['Priyansu','Puja','Utkalika','Ankita'],
      'Age':[23,40,29,27],
      'City':['Rourkela','Bhubaneswar','Balasore','Jamshedpur']}
df=pd.DataFrame(data)
print(df)

df['Score'] = [85, 90, 88, 70]
print(df)

print(df.describe())

print('Is data is Empty?',df.empty)

       Name  Age         City
0  Priyansu   23     Rourkela
1      Puja   40  Bhubaneswar
2  Utkalika   29     Balasore
3    Ankita   27   Jamshedpur
       Name  Age         City  Score
0  Priyansu   23     Rourkela     85
1      Puja   40  Bhubaneswar     90
2  Utkalika   29     Balasore     88
3    Ankita   27   Jamshedpur     70
             Age      Score
count   4.000000   4.000000
mean   29.750000  83.250000
std     7.274384   9.069179
min    23.000000  70.000000
25%    26.000000  81.250000
50%    28.000000  86.500000
75%    31.750000  88.500000
max    40.000000  90.000000
Is data is Empty? False

In [24]:
import pandas as pd
data={'Name':['Priyansu','Puja','Akhanshya','Utkalika','Ankita'],
      'Age':[23,40,29,27,38],
      'City':['Rourkela','Bhubaneswar','Cuttack','Balasore','Jamshedpur']}
df=pd.DataFrame(data)
print(df)

df=df.drop('City', axis=1)
print(df)

        Name  Age         City
0   Priyansu   23     Rourkela
1       Puja   40  Bhubaneswar
2  Akhanshya   29      Cuttack
3   Utkalika   27     Balasore
4     Ankita   38   Jamshedpur
        Name  Age
0   Priyansu   23
1       Puja   40
2  Akhanshya   29
3   Utkalika   27
4     Ankita   38

In [27]:
import pandas as pd
import numpy as np

data = {'Name': ['Priyansu', 'Puja', 'Akhanshya', 'Utkalika', 'Ankita'],
        'Age': [23, 40, np.nan, 27, 38],
        'City': ['Rourkela', 'Bhubaneswar', 'Cuttack', np.nan, 'Jamshedpur'],
        'Score': [85, 90, 88, 70, np.nan]}
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

print("\nMissing values per column:")
print(df.isnull().sum())

# Handle missing values

df_dropped = df.dropna()
print("\nDataFrame after dropping rows with missing values:")
print(df_dropped)

df_filled_zero = df.fillna(0)
print("\nDataFrame after filling missing values with 0:")
print(df_filled_zero)

Original DataFrame:
        Name   Age         City  Score
0   Priyansu  23.0     Rourkela   85.0
1       Puja  40.0  Bhubaneswar   90.0
2  Akhanshya   NaN      Cuttack   88.0
3   Utkalika  27.0          NaN   70.0
4     Ankita  38.0   Jamshedpur    NaN

Missing values per column:
Name     0
Age      1
City     1
Score    1
dtype: int64

DataFrame after dropping rows with missing values:
       Name   Age         City  Score
0  Priyansu  23.0     Rourkela   85.0
1      Puja  40.0  Bhubaneswar   90.0

DataFrame after filling missing values with 0:
        Name   Age         City  Score
0   Priyansu  23.0     Rourkela   85.0
1       Puja  40.0  Bhubaneswar   90.0
2  Akhanshya   0.0      Cuttack   88.0
3   Utkalika  27.0            0   70.0
4     Ankita  38.0   Jamshedpur    0.0